Repository: AhmedMSoultan/DesignCode
Catalog: DesignCode-UIKit/Helpers/*.lproj/Localizable.strings
Languages: ar

source: SwiftUI Concurrency
ar: SwiftUI التزامن

source: NEW VIDEO
ar: فيديو جديد

source: Build an iOS app for iOS 15 with custom layouts, animations and more!
ar: أنشئ تطبيق iOS لنظام iOS 15 بتنسيقات مخصصة ورسوم متحركة والمزيد!

source: Flutter for Designers
ar: Flutter للمصممين

source: 20 sections - 3 hours
ar: 20 قسمًا - 3 ساعات

source: Build a Flutter app for iOS and Android with custom layouts, animations and more!
ar: أنشئ تطبيق Flutter لنظامي التشغيل iOS و Android بتنسيقات مخصصة ورسوم متحركة والمزيد!

source: Build a React app with custom layouts, animations and more!
ar: أنشئ تطبيق React بتنسيقات مخصصة ورسوم متحركة والمزيد!

source: Advanced Custom Layout
ar: تخطيط مخصص متقدم

source: SwiftUI for iOS 15
ar: SwiftUI لنظام iOS 15

source: Build an iOS app for iOS 15 with custom layouts.
ar: أنشئ تطبيق iOS لنظام iOS 15 بتنسيقات مخصصة.

source: Coding the Home View
ar: ترميز طريقة العرض الرئيسية

source: Learn about the formatted(date:time:) method and AsyncImage
ar: تعرف على طريقة (date: time :) المنسقة وطريقة AsyncImage

source: Colors and Shadows
ar: الألوان والظلال

source: Read about the design guidelines and how you can use color to maximize your best views
ar: اقرأ حول إرشادات التصميم وكيف يمكنك استخدام اللون لتعظيم أفضل عروضك

source: iOS Development
ar: تطوير iOS

source: UI Design
ar: تصميم واجهة المستخدم

source: Web Development
ar: تطوير الويب

source: History
ar: السجل

source: Favorites
ar: المفضلة

source: Downloads
ar: التنزيلات
